mafeiGitHub/stm32Mp3/main/main.cpp
  SD_Init();
  if (BSP_PB_GetState (BUTTON_WAKEUP) == GPIO_PIN_SET) {
    //{{{  usb sd MSC
    USBD_Init (&USBD_Device, &MSC_Desc, 0);
    USBD_RegisterClass (&USBD_Device, &USBD_MSC);
    USBD_MSC_RegisterStorage (&USBD_Device, (USBD_StorageTypeDef*)(&USBD_DISK_fops));
    USBD_Start (&USBD_Device);

    cLcd::debug ("USB ok");
    }
    //}}}
  else if (SD_present()) {
    //{{{  sd MP3
    mFrameOffsets = (int*)bigMalloc (60*60*40*sizeof(int), "mp3FrameOff");
    mWave = (uint8_t*)bigMalloc (60*60*40*2*sizeof(uint8_t), "mp3Wave");  // 1 hour of 40 mp3 frames per sec
    mWave[0] = 0;
    mWaveLoadFrame = 0;

    initMp3Menu (mRoot);
    mLcd->setShowDebug (false, false, false, true);  // disable debug - title, info, lcdStats, footer

    TaskHandle_t handle;
    xTaskCreate ((TaskFunction_t)mp3PlayThread, "mp3Play", 8192, 0, 3, &handle);
    }
    //}}}
  else {
    //{{{  net HLS
    mReSamples = (int16_t*)bigMalloc (4096, "hlsResamples");
    memset (mReSamples, 0, 4096);

    mLcd->setShowDebug (false, false, false, false);  // debug - title, info, lcdStats, footer

    mHls = new cHls();
    hlsMenu (mRoot, mHls);

    vSemaphoreCreateBinary (mHlsSem);

    TaskHandle_t handle;
    #ifdef ESP8266
      xTaskCreate ((TaskFunction_t)hlsLoaderThread, "hlsLoad", 14000, 0, 3, &handle);
      xTaskCreate ((TaskFunction_t)hlsPlayerThread, "hlsPlay", 2000, 0, 4, &handle);
    #else
      xTaskCreate ((TaskFunction_t)hlsNetThread, "Net", 1024, 0, 3, &handle);
    #endif
    }
    //}}}

  //{{{  init vars
  int16_t x[kMaxTouch];
  int16_t y[kMaxTouch];
  uint8_t z[kMaxTouch];
  int pressed[kMaxTouch];
  for (auto touch = 0; touch < kMaxTouch; touch++)
    pressed[touch] = 0;
  //}}}
  BSP_TS_Init (mRoot->getPixWidth(), mRoot->getPixHeight());
  while (true) {
    //bool button = true;
    bool button = BSP_PB_GetState (BUTTON_WAKEUP) == GPIO_PIN_SET;
    TS_StateTypeDef tsState;
    BSP_TS_GetState (&tsState);
    for (auto touch = 0; touch < kMaxTouch; touch++) {
      if (touch < tsState.touchDetected) {
        //{{{  pressed
        auto xinc = pressed[touch] ? tsState.touchX[touch] - x[touch] : 0;
        auto yinc = pressed[touch] ? tsState.touchY[touch] - y[touch] : 0;
        x[touch] = tsState.touchX[touch];
        y[touch] = tsState.touchY[touch];
        z[touch] = tsState.touchWeight[touch];
        if (touch == 0)
          button ? mLcd->press (pressed[0], x[0], y[0], z[0], xinc, yinc) : mRoot->press (pressed[0], x[0], y[0], z[0], xinc, yinc);
        pressed[touch]++;
        }
        //}}}
      else {
        //{{{  released
        x[touch] = 0;
        y[touch] = 0;
        z[touch] = 0;
        if (!touch && pressed[0])
          mRoot->release();
        pressed[touch] = 0;
        }
        //}}}
      }

    #ifdef STM32F769I_DISCO
      //{{{  update led2,3
      button ? BSP_LED_On (LED2) : BSP_LED_Off (LED2);
      tsState.touchDetected ? BSP_LED_On (LED3) : BSP_LED_Off (LED3);
      //}}}
    #endif

    mLcd->startRender();
    button ? mLcd->clear (COL_BLACK) : mRoot->render (mLcd);
    //{{{  cursor
    //if (tsState.touchDetected)
    //  mLcd->renderCursor (COL_MAGENTA, x[0], y[0], z[0] ? z[0] : cLcd::getHeight()/10);
    //}}}
    if (kSdDebug)
      mLcd->text (COL_YELLOW, cWidget::getFontHeight(), SD_info(),
                  mLcd->getLcdWidthPix()/2, mLcd->getLcdHeightPix()- cWidget::getBoxHeight(),
                  mLcd->getLcdWidthPix(), cWidget::getBoxHeight());
    mLcd->endRender (button);
    if (mHls) {
      if (mHls->mVolumeChanged && (int(mHls->mVolume * 100) != mIntVolume)) {
        //{{{  set volume
        mIntVolume = int(mHls->mVolume * 100);
        BSP_AUDIO_OUT_SetVolume (mIntVolume);
        mHls->mVolumeChanged = false;
        }
        //}}}
      }
    else {
      if (mVolumeChanged && (int(mVolume * 100) != mIntVolume)) {
        //{{{  set volume
        mIntVolume = int(mVolume * 100);
        BSP_AUDIO_OUT_SetVolume (mIntVolume);
        mVolumeChanged = false;
        }
        //}}}
      }
    }
  }
//}}}

//{{{
int main() {

  SCB_EnableICache();
  SCB_EnableDCache();
  HAL_Init();
  initMpuRegions();
  initClock();

  HeapRegion_t xHeapRegions[] = { {(uint8_t*)SDRAM_HEAP, SDRAM_HEAP_SIZE }, { nullptr, 0 } };
  vPortDefineHeapRegions (xHeapRegions);

  BSP_QSPI_Init();
  BSP_QSPI_EnableMemoryMappedMode();
  QUADSPI->LPTR = 0xFFF; // Configure QSPI: LPTR register with the low-power time out value

  BSP_PB_Init (BUTTON_WAKEUP, BUTTON_MODE_GPIO);
  BSP_LED_Init (LED1);
  #ifdef STM32F769I_DISCO
    BSP_LED_Init (LED2);
    BSP_LED_Init (LED3);
  #endif

  mLcd = cLcd::create ("Player built at " + std::string(__TIME__) + " on " + std::string(__DATE__));
  mRoot = new cRootContainer (mLcd->getLcdWidthPix(), mLcd->getLcdHeightPix());

  vSemaphoreCreateBinary (mAudSem);

  TaskHandle_t handle;
  xTaskCreate ((TaskFunction_t)mainThread, "main", 2048, 0, 3, &handle);

  vTaskStartScheduler();

  return 0;
  }
//}}}
